wisteria-1c/Конфигурация/InformationRegisters/СогласованиеЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СогласованиеЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийСогласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СогласованиеЗаявок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить текущего согласующего по заявке.
// 
// Параметры:
//  Документ - ДокументСсылка.РасходДСПлан - заявка на расход денег
// 
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - текущий согласующий
//
Функция ПолучитьТекущегоСогласующего(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СогласованиеЗаявок.ТекущийСогласующий
		|ИЗ
		|	РегистрСведений.СогласованиеЗаявок КАК СогласованиеЗаявок
		|ГДЕ
		|	СогласованиеЗаявок.ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС";
	
	Запрос.УстановитьПараметр("ЗаявкаНаРасходДС", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекущийСогласующий;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Проверяет, есть ли заявки на согласование для указанного пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьЗаявкиНаСогласование(Пользователь) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СогласованиеЗаявок.ЗаявкаНаРасходДС
		|ИЗ
		|	РегистрСведений.СогласованиеЗаявок КАК СогласованиеЗаявок
		|ГДЕ
		|	СогласованиеЗаявок.ТекущийСогласующий = &ТекущийСогласующий";
	
	Запрос.УстановитьПараметр("ТекущийСогласующий", Пользователь);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Обновить статус согласования заявки
// 
// Параметры:
//  Документ 			- ДокументСсылка.РасходДСПлан				  - заявка на расход денег
//  МаршрутСогласования - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут согласования заявки
//
Процедура ОбновитьСтатусСогласованияЗаявки(Документ, МаршрутСогласования) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МаршрутСогласования) Тогда
		
		НовыйСогласующий = Справочники.Пользователи.ПустаяСсылка();
		
	Иначе
	
		ТекущийСогласующий = ПолучитьТекущегоСогласующего(Документ);
			
		Если ТекущийСогласующий <> Справочники.Пользователи.ПустаяСсылка() Тогда
			Если ТекущийСогласующий = Неопределено Тогда
				НовыйСогласующий = Справочники.МаршрутыСогласованияЗаявок.ПолучитьПервогоУчастникаМаршрута(МаршрутСогласования);
			ИначеЕсли Пользователи.ТекущийПользователь() = ТекущийСогласующий Тогда
				НовыйСогласующий = Справочники.МаршрутыСогласованияЗаявок.ПолучитьСледующегоУчастникаМаршрута(МаршрутСогласования,
																											  ТекущийСогласующий);
			Иначе
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаРасходДС.Установить(Документ);
				
	Запись = НаборЗаписей.Добавить();
			
	Запись.ЗаявкаНаРасходДС = Документ;
	Запись.ТекущийСогласующий = НовыйСогласующий;
				
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Перезапустить процесс согласования заявки.
// 
// Параметры:
//  Документ 			- ДокументСсылка.РасходДСПлан 				  - заявка на расход денег
//  МаршрутСогласования - СправочникСсылка.МаршрутыСогласованияЗаявок - маршрут согласования заявки
//
Процедура ПерезапуститьПроцессСогласованияЗаявки(Документ, МаршрутСогласования) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) 
	 ИЛИ Не ЗначениеЗаполнено(МаршрутСогласования)
	 ИЛИ МаршрутСогласования = Справочники.МаршрутыСогласованияЗаявок.АвтоматическоеУтверждениеЗаявки Тогда
		Возврат;
	КонецЕсли;
	
	ПервыйСогласующий = Справочники.МаршрутыСогласованияЗаявок.ПолучитьПервогоУчастникаМаршрута(МаршрутСогласования);
	
	УстановитьПривилегированныйРежим(Истина);
		
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаРасходДС.Установить(Документ);
				
	Запись = НаборЗаписей.Добавить();
			
	Запись.ЗаявкаНаРасходДС = Документ;
	Запись.ТекущийСогласующий = ПервыйСогласующий;
				
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Согласовывает заявку.
// 
// Параметры:
//  Документ - ДокументСсылка.РасходДСПлан - заявка на расход денег
//
Процедура СогласоватьУтвержденнуюЗаявку(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
		
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаРасходДС.Установить(Документ);
				
	Запись = НаборЗаписей.Добавить();
			
	Запись.ЗаявкаНаРасходДС = Документ;
	Запись.ТекущийСогласующий = Справочники.Пользователи.ПустаяСсылка();
				
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Проверяет, что заявка согласована
// 
// Параметры:
//  Ссылка - ДокументСсылка.РасходДСПлан - заявка на расход денег
// 
// Возвращаемое значение:
//  Булево - Если истина, то заявка прошла маршрут согласования
//
Функция ЗаявкаСогласована(Ссылка) Экспорт
	
	Возврат ПолучитьТекущегоСогласующего(Ссылка) = Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
